[
    {
        "@context":"http://schema.org",
        "@type":"Product",
        "name":"'Mah Jong' 35 Piece Living Room Set by Missoni for Roche Bobois France, Signed",
        "description":"This incredibly large living room set is by Missoni for Roche Bobois, called the \"Mah Jong\" sectional sofa but also included is a Missoni Home 'Domino' room sized area rug which matches the sectional sofa and cushions. Included in this set are 35 pieces in total which include 18 square seat cushions (which also function as large ottomans and can be stacked), 9 seat backs, 7 small pillows and 1 large room sized rug. \r\n\r\nThe best part of this set is that you can mix and match the cushions, pillows and seat backs to make any style arrangement you wish, and create a customized room which you can change as frequently as your heart desires... you can create small and large sofas, loveseats, lounge chairs and ottomans using the cushions and seat backs. The photos show the seat backs coordinated with matching cushions but you can alternate those as well and make this as fun and / or funky as you would like! \r\n\r\nIdeal for all kinds of uses... consider this set for a large screening room, den or living room, bedroom seating, entertainment room, commercial uses such as a hotel or boutique lounge, you can even spread the pieces around the house and put some in a large walk-in closet / dressing room, kids room, classroom or training room, and for those limited on space in an apartment - you can stack the cushions and then spread them out when you have company. A great way to make the most of space by keeping versatile with this Roche Bobois Mah Jong seating system. \r\n\r\nOriginally designed in the 1971 by Hans Hopfer the 'Mah Jong' seating system is as iconic today as it was then. Here is what Roche Bobois has to say about this design and the designer: Painter, sculptor, designer... Hans Hopfer designed sofas that are, for many, the indisputable “signature” of Roche Bobois’ collections. In the 1970s, Hopfer’s innovative and informal approach to comfort had a profound influence on the way people furnished and arranged their living space. In 1971, he created the Mah Jong, a sofa based on the total freedom of function and form. Starting with three basic elements that can be combined or stacked, the Mah Jong allows limitless options of composition. It can be an armchair, sofa, lounge chair or bed; a space in which to rest, to play or to lounge. It encourages experimentation and breaks the rules of formal living, reflecting the nonconformist era in which it was born. Avant-garde when first created, iconic today, and “dressed” by Missoni Home and Jean Paul Gaultier, this “free form” modular seating is the reference point for fully modular and creative design.\r\n\r\nIncluded in this listing are 35 Pieces Total which include:\r\n18 Square Seat Cushions, 9 Seat Backs, 7 Small Pillows, and 1 Large Room Sized Rug\r\n\r\nWe can consider breaking the set, if you wish specific pieces only in this set contact us for more details. In addition, we have another 18 piece Missoni set not listed yet, if you wish to add to this set or create a custom mix of elements. And on top of all of this, we have a 20 piece Jean Paul Gaultier for Roche Bobois set as well which includes some cushions and seat backs in his signature silk. Contact us for more details on our other sets.\r\n\r\nHere is a breakdown of each piece with fabric names included in this listing: \r\n\r\n1 Domino Area Rug\r\n3 Straight Backs - GLENVILLE PAPRIKA\r\n6 Seat Cushions - GLENVILLE PAPRIKA\r\n1 Seat Cushion - NADAUN\r\n1 Straight Back - ROING\r\n1 Seat Cushion - ROING\r\n1 Seat Cushion - RAFAH YELLOW\r\n1 Straight Back - LOBELIA 159\r\n1 Seat Cushion - LOBELIA 159\r\n1 Seat Cushion - RAFAH 56 RED\r\n2 Straight Backs - RAFAH 74 BLUE\r\n2 Seat Cushions - RAFAH 74 BLUE\r\n1 Seat Cushion - PUEBLA\r\n1 Seat Cushion - PEDRA\r\n1 Straight Back - GLENVILLE VIOLET\r\n2 Seat Cushions - GLENVILLE VIOLET\r\n1 Straight Back -LIBERTAD 159\r\n1 Seat Cushion - LIBERTAD 159\r\n1 Small Pillow - RAFAH 40 YELLOW\r\n1 Small Pillow - RAFAH PURPLE\r\n1 Small Pillow - ROING\r\n1 Small Pillow - LOBELIA 159\r\n1 Small Pillow - LIBERTAD 140 PASTEL\r\n1 Small Pillow - PARAGUAY\r\n1 Small Pillow - GLENVILLE CAMELIA\r\n\r\nWe believe the fabric names to be correct however this was based on our best guess judgement with fabric names we could find in the Missoni catalogue. If you have any concerns about the names listed above please contact us so we can try to confirm for you. \r\n\r\nThis humungous Mah Jong sectional sofa system by Hans Hopfer for Missoni and Roche Bobois would work great in a Post-Modern, Mid-Century Modern, Space Age Mod, Scandanavian Modern or Danish Modern home or penthouse apartment but could also look fantastic in a Contemporary or Zen / Minimalism room. Also consider mixing it up in a Traditional, Transitional, Hollywood Regency, Classical or Art Deco room with a splash of juxtaposition. Would also be an apt choice in a commercial project such as a hotel lobby lounge or members club, creative design studio or high-rise executive office. Use this set to create sofa sections, settee sections, easy chair sections, ottomans and chaises using the different elements to customize a seating arrangement that best suits your room. \r\n\r\nMEASUREMENTS:\r\nSeat Cushions Individually: H 7\" x W 39\" x D 39\" \r\nSingle Seat Cushion with Seat Back: H 20.75\" x W 40\" x D 40\" \r\nDouble Seat Cushions with Seat Back: H 27.75\" x W 40\" x D 40\" \r\nSmall Pillows: 8\" x 18\" x 18\" \r\nRug: 116\" x 156\" \r\n\r\nCONDITION: \r\nVery good to excellent condition with light minor wear to a few areas. Ready to be used immediately in a high end designer project.",
        "image":"https://a.1stdibscdn.com/mah-jong-35-piece-living-room-set-by-missoni-for-roche-bobois-france-signed-for-sale/1121189/f_195891221603784704828/19589122_master.jpg?width=768",
        "itemCondition":"EXCELLENT",
        "url":"https://www.www.1stdibs.com/furniture/seating/sectional-sofas/mah-jong-35-piece-living-room-set-missoni-roche-bobois-france-signed/id-f_19589122/",
        "offers":{
            "@type":"Offer",
            "itemCondition":"http://schema.org/UsedCondition",
            "availability":"http://schema.org/InStock",
            "seller":{
                "@type":"FurnitureStore",
                "image":"https://a.1stdibscdn.com/dealer_images/13302/f_13302_pdp.png",
                "name":"Automaton",
                "address":{
                    "@type":"PostalAddress",
                    "streetAddress":"903 S. Hill St",
                    "addressLocality":"Los Angeles",
                    "addressRegion":"CA",
                    "postalCode":"90015",
                    "addressCountry":"US"
                }
            },
            "priceCurrency":"USD",
            "price":61500
        },
        "productionDate":"2010-",
        "category":"Sectional Sofas"
    },{
        "@context":"http://schema.org",
        "@type":"BreadcrumbList",
        "itemListElement":[
            {
                "@type":"ListItem",
                "position":1,
                "item":{
                    "name":"Home",
                    "@id":"/"
                }
            },{
                "@type":"ListItem",
                "position":2,
                "item":{
                    "name":"Furniture",
                    "@id":"/furniture/"
                }
            },{
                "@type":"ListItem",
                "position":3,
                "item":{
                    "name":"Seating",
                    "@id":"/furniture/seating/"
                }
            },{
                "@type":"ListItem",
                "position":4,
                "item":{
                    "name":"Sectional Sofas",
                    "@id":"/furniture/seating/sectional-sofas/"
                }
            }
        ]
    }
]